app/controllers/students_controller.rb

  def update
    @student = Student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-04-08 17:34:41.874187"], ["id", 1]]